# Напишите программу которая запрашивает у пользователя день и месяц 
# а затем выводит сообщение о текущем дне и месяце

day = input('Какой сейчас день=')
month = input('Какой сейчас месяц=')

print('Сегдня', day, 'число,')
print(month, 'месяц.')