# Напишите программу в которой расстояние указанное в 
# милях переводиться в киллометры. Учесть что одна миля 
# примерно 1.6 киллометров. Расстояние в миллях вводится
# пользователем с клавиатуры.

mile = int (input('input mile='))

kilometr = mile * 1.6

print(kilometr)
