#Пользователь вводит текущий день и год своего рождения. Программа вычисляет возраст пользователя.

CurrentYear = int(input('Какой сейчас год='))
HP = int(input('Введите год своего рождения='))

print('Вам', CurrentYear - HP, 'лет')